{
  "openings": {
    "letters": ["Hi, ", "I'm a Nilson Weng,", "full-stack developer."],
    "typewriter": [
      "Proficient in TypeScript",
      "Specialized in Node.js, React, Next.js",
      "Well-versed in web development",
      "Improving Web Performance and SEO"
    ],
    "learnmore": "LEARN MORE"
  },
  "about": {
    "title": "About",
    "texts": [
      "I am a full-stack engineer with 3.5 years of development experience, deeply knowledgeable about building web applications and optimizing their performance.",
      "Currently, I work at a well-known stock investment software company, where I am responsible for revamping the marketing website for their flagship product, XQ. ",
      "In my past career, I also worked at a renowned shoe manufacturing company in Taichung, where I participated in teams of over 20 members, developing large-scale business ERP systems using Angular. Additionally, I have experience in game development, implementing 2D and 3D animation effects using Pixi.js and Babylon.js.",
      "In terms of skills, TypeScript is my main programming language. I'm proficient in frontend frameworks for building user interfaces, backend programming for implementing APIs, SQL for database management, system architecture planning, and deployment strategies. I also have a strong understanding of network protocols and security measures.",
      "Programming is a hobby for me, so I am eager to learn new technological knowledge and enjoy sharing what I've learned. I thrive on challenging development projects and look forward to collaborating with passionate and creative companies or teams."
    ]
  },
  "experience": {
    "title": "Experience",
    "texts": [
      "I obtained my bachelor's degree in CSIE from Tung-Hai University in Taiwan. Currently, I have accumulated 3.5 years of experience in developing web applications and web servers, having worked on a variety of projects ranging from personal websites and web-based games to large-scale ERP systems for business use."
    ]
  },
  "experience-timeline": [
    {
      "id": "work3",
      "companyImg": "/img/experiences/sysjust.jpg",
      "companyName": "SysJust CO., LTD",
      "jobTitle": "Frontend Developer",
      "jobPosition": "Engineer",
      "location": "Taichung",
      "begintime": [2023, 5],
      "endtime": [2024, 6],
      "texts": [
        "Rebuild the marketing website for the company's flagship product, XQ.",
        "Utilize frameworks like Astro and Next.js, leveraging SSG to optimize website performance while reducing server costs.",
        "Adopting Next.js ISR, Optimizing build time from 5 min to 30 sec.",
        "Crafting UI components using React and Tailwind, then validate their effects with Storybook.",
        "Using TypeScript, develop UI components and libraries, unit testing, packaging, and publishing.",
        "Implement an Express-based proxy server to resolve CORS issues when accessing APIs from the client-side.",
        "Aid in planning CICD processes, enabling on-demand content changes, and automating website rebuilding and deployment."
      ]
    },
    {
      "id": "work2",
      "companyImg": "/img/experiences/lattek.jpg",
      "companyName": "Dah Lih Puh Co., Ltd",
      "jobTitle": "Full Stack Developer",
      "jobPosition": "Senior Engineer",
      "location": "Taichung",
      "begintime": [2021, 12],
      "endtime": [2022, 9],
      "texts": [
        "Assist companies in building the next-generation ERP systems.",
        "Help the architect maintain the company's front-end shared modules.",
        "Use Prettier and ESLint improve the quality and readability of code",
        "Use Angular (2+) to construct the user interface.",
        "Build RESTful CRUD APIs with ASP.NET Core (3.1+).",
        "Write PL/SQL stored procedures to interact with the Oracle database."
      ]
    },
    {
      "id": "work1",
      "companyImg": "/img/experiences/chungyo.png",
      "companyName": "La Pluma Fashion Group Co., Ltd",
      "jobTitle": "Game Program Developer",
      "jobPosition": "Assistant Engineer",
      "location": "Taichung",
      "begintime": [2019, 10],
      "endtime": [2021, 3],
      "texts": [
        "Develop web-based game projects using Canvas 2D and WebGL.",
        "Maintain the game to run correctly on browsers and mobile devices.",
        "Use Pixi.js to create 2D games such as slots, little mary slots, etc.",
        "Use Babylon.js to create 3D games like Coin Pusher.",
        "Integrate APIs to complete the main game and other payment functions."
      ]
    },
    {
      "id": "university",
      "companyImg": "/img/experiences/thu.png",
      "companyName": "Tung Hai University",
      "jobTitle": "Computer Science and Information Engineering",
      "jobPosition": "Bachelor",
      "location": "Taichung",
      "begintime": [2013, 7],
      "endtime": [2017, 1],
      "texts": [
        "I entered the second year of the CSIE Department as a transfer student from the same college's architecture department."
      ]
    }
  ],
  "skills": {
    "title": "Skills",
    "texts": [
      "The language I excel in is <b>TypeScript</b>.",
      "In terms of technical expertise, I specialize more in <b>frontend technologies</b>.",
      "As a seasoned developer, rather than simply being familiar with technical frameworks, I focus on using the most suitable technology to solve problems.",
      "For web applications with more static content, I utilize <b>Astro</b> and employ <b>SSG</b> (Static Site Generation) technology to reduce server costs.",
      "For websites requiring dynamic content and SEO, I opt for Next.js to enhance development efficiency and reduce operational costs.",
      "In backend technologies, I am proficient in deploying my <b>Node.js</b> services in a <b>Linux</b> environment,",
      "using <b>Express.js</b> to solve CORS issues, provide API services, and employ localized data storage to shorten build times."
    ]
  },
  "projects": {
    "title": "Projects",
    "texts": ["There are my side projects here."]
  },
  "contact": {
    "title": "Contact",
    "texts": [
      "Currently, I'm seeking employment opportunities that match the technologies I work with.",
      "<b>remote work is preferred</b>. I'm always up for new challenges and enjoy working with companies or people who share my passion for innovation and creativity.",
      "Also, if you have any other question or request, don't hesitate to contact me using the form here!"
    ],
    "fields": {
      "name": "Name",
      "email": "Email",
      "topic": "Topic",
      "message": "Message"
    },
    "topics": {
      "choose": "Choose one",
      "options": [
        {
          "id": "job",
          "text": "Job Invitation"
        },
        {
          "id": "suggest",
          "text": "Give me suggestion"
        },
        {
          "id": "ask",
          "text": "Questions for me?"
        },
        {
          "id": "other",
          "text": "Other"
        }
      ]
    },
    "send": "SEND"
  }
}
